Esp32forth-org/PeterJakacki/Esp32Forth-Tachyon/ESP32forth-Tachyon.ino
( ANSI - PBJ )


( ANSI COLORS )
0	constant black
1	constant red
2	constant green
3	constant yellow
4	constant blue
5	constant magenta
6	constant cyan
7	constant white

0 	value _ansi
: ANSI ( n -- )		_ansi 0= IF FOR AFT DROP THEN NEXT R> THEN DROP ;

: CLS 			12 EMIT ;

: ESCX ( ch -- )	27 EMIT EMIT ;
: ESC[ 			[char] [ ESCX ;
: HOME			0 ANSI [char] H ESC[ EMIT ;
: COL ( col fg/bg -- )	ESC[ EMIT [char] 0 + EMIT [char] m EMIT ;
: PEN ( col -- )	1 ANSI 7 AND [char] 3 COL ;
: PAPER ( col -- )	1 ANSI [char] 4 COL ;


( 0 plain 1 bold 2 dim 3 rev 4 uline )
: ATR ( ch -- )		ESC[ EMIT [char] m EMIT ;
: PLAIN			0 ANSI [char] 0 ATR ;

: REVERSE		0 ANSI [char] 7 ATR ;
: BOLD			0 ANSI [char] 1 ATR ;
: UL          		0 ANSI [char] 4 ATR ;
: BLINKING	        0 ANSI [char] 5 ATR ;

: _CSI			SWAP PRINT EMIT ;
: CUR ( cmd n -- )	[char] [ ESCX SWAP _CSI ;
: XY ( x y -- )		2 ANSI [char] ; SWAP CUR [char] H _CSI ;






( Better Errors )
: .ERROR	plain bold red pen ."  *ERROR* " ;
: notfound ( a n n -- )
   if .ERROR type ."  NOT FOUND! "  -1 throw then ;
' notfound 'notfound !

( Abort )
: abort   -1 throw ;
: abort"   postpone ." postpone cr -2 aliteral postpone throw ; immediate

( Input )
: raw.s   depth 0 max for aft sp@ r@ cells - @ . then next ;
: .s   ." <" depth n. ." > " raw.s cr ;
\ .s   depth 0 max for aft cr sp@ r@ cells - @ dup .l space . then next ;

variable echo echo ~~   0 value prevch
: *emit ( n -- ) dup 13 = if drop cr else emit then ;
: ?echo ( n -- ) echo @ if *emit else drop then ;

: aprompt    plain blue pen  >r >r depth str type r> r> 35 emit 62 emit space plain  ;
' aprompt value _prompt
: !prompt   ['] aprompt to _prompt ;
: prompt     _prompt execute ;

\ defer ?ctrls ' noop is ?ctrls

: *key ( -- n )
  begin
    key
    dup nl = if drop prevch 13 = if 0 else 13 then then
 \   ?ctrls
    dup to prevch
    ?dup
  until
  ;


: eat-till-cr   begin *key dup 13 = if ?echo exit else drop then again ;

: accept1 ( adr max -- cnt )
   0 swap plain bold yellow pen space 8 emit
   begin 2dup <
   while ( adr cnt max )
     *key ( adr cnt max key )
     dup 13 = if plain blue pen ."  --- " 2drop nip plain exit then
     dup 8 = over 127 = or
     if drop over if rot 1- rot 1- rot 8 ?echo bl ?echo 8 ?echo then
     else
       dup ?echo
       >r rot r> over c! 1+ -rot swap 1+ swap
     then
   repeat drop nip
   eat-till-cr plain
;
' accept1 value _accept
: accept		_accept execute ;

200 constant input-limit
: tib ( -- a ) 		'tib @ ;
create input-buffer   	input-limit allot
: tib-setup   		input-buffer 'tib ! ;
: refill   		tib-setup tib input-limit prompt accept #tib ! >in ~ -1 ;


( Stack Guards )
sp0 'stack-cells @ 2 3 */ cells + constant sp-limit
: ?stack   sp@ sp0 < if ." STACK UNDERFLOW " -4 throw then
           sp-limit sp@ < if ." STACK OVERFLOW " -3 throw then ;

( REPL )
: eolok   	    	plain blue pen ."  ok" cr ;
' eolok value _eol
: eol 		    	_eol execute ;
: evaluate-buffer   	begin >in @ #tib @ < while evaluate1 ?stack repeat ;
: evaluate ( a n -- ) 	'tib @ >r #tib @ >r >in @ >r
                     	#tib ! 'tib ! >in ~ evaluate-buffer
                      	r> >in ! r> #tib ! r> 'tib ! ;
: evaluate&fill
   begin >in @ #tib @ >= if eol refill drop then evaluate-buffer again ;
: quit
   #tib @ >in !
   begin ['] evaluate&fill catch
         if state ~  fp0 fp! rp0 rp! .ERROR cr then
	 depth 0< if !sp then
   again ;
variable boot-prompt
: free. ( nf nu -- ) 2dup swap . ." free + " . ." used = " 2dup + . ." total ("
                     over + 100 -rot */ n. ." % free)" ;
( rev 564a8fc68b545ebeb3ab+ )
: .ver		."  v7.0.7.15 - PBJ240829" ;
: raw-ok   .ver cr
           boot-prompt @ if boot-prompt @ execute then
           ." Forth dictionary: " remaining used free. cr
           ." 3 x Forth stacks: " 'stack-cells @ cells . ." bytes each" cr
           !sp quit ;
( Interpret time conditionals )

: DEFINED? ( "name" -- xt|0 )
   begin bl parse dup 0= while 2drop refill 0= throw repeat
   find state @ if aliteral then ; immediate
defer [SKIP]
: [THEN] ; immediate
: [ELSE] [SKIP] ; immediate
: [IF] 0= if [SKIP] then ; immediate
: [SKIP]' 0 begin postpone defined? dup if
    dup ['] [IF] = if swap 1+ swap then
    dup ['] [ELSE] = if swap dup 0 <= if 2drop exit then swap then
    dup ['] [THEN] = if swap 1- dup 0< if 2drop exit then swap then
  then drop again ;
' [SKIP]' is [SKIP]
( Implement Vocabularies )
( normal: link, flags&len, code )
( vocab:  link, flags&len, code | link , len=0, voclink )
variable last-vocabulary
: vocabulary ( "name" )
  create current @ 2 cells + , 0 , last-vocabulary @ ,
  current @ @ last-vocabulary !
  does> context ! ;
: definitions   context @ current ! ;
vocabulary FORTH
' forth >body @ >link ' forth >body !
forth definitions

( Make it easy to transfer words between vocabularies )
: xt-find& ( xt -- xt& ) context @ begin 2dup @ <> while @ >link& repeat nip ;
: xt-hide ( xt -- ) xt-find& dup @ >link swap ! ;
8 constant BUILTIN_MARK
: xt-transfer ( xt --  ) dup >flags BUILTIN_MARK and if drop exit then
  dup xt-hide   current @ @ over >link& !   current @ ! ;
: transfer ( "name" ) ' xt-transfer ;
: }transfer ;
: transfer{ begin ' dup ['] }transfer = if drop exit then xt-transfer again ;

( Watered down versions of these )
: only   forth context cell+ ~ ;
: voc-stack-end ( -- a ) context begin dup @ while cell+ repeat ;
: also   context context cell+ voc-stack-end over - 2 cells + cmove> ;
: previous
  voc-stack-end context cell+ = throw
  context cell+ context voc-stack-end over - cell+ cmove ;
: sealed   last-vocabulary @ >body ~ ;

( Hide some words in an internals vocabulary )
vocabulary internals   internals definitions

( Vocabulary chain for current scope, place at the -1 position )
variable scope   scope context cell - !

transfer{
  xt-find& xt-hide xt-transfer
  voc-stack-end last-vocabulary notfound
  *key *emit prevch eat-till-cr
  immediate? input-buffer ?echo prompt !prompt aprompt _prompt
  evaluate-buffer evaluate&fill aliteral value-bind
  leaving( )leaving leaving leaving,
  parse-quote digit $@ raw.s
  tib-setup input-limit sp-limit ?stack
  [SKIP] [SKIP]' raw-ok boot-prompt free.
  $place zplace BUILTIN_MARK
}transfer

( Move branching opcodes to separate vocabulary )
vocabulary internalized  internalized definitions
: cleave   ' >link xt-transfer ;
cleave begin   cleave again   cleave until
cleave ahead   cleave then    cleave if
cleave else    cleave while   cleave repeat
cleave aft     cleave for     cleave next
cleave do      cleave ?do     cleave +loop
cleave loop    cleave leave

